function TermsOfService() {
    return (
        <div className='container pt-5 pb-5'>
            <h2>Пользовательское соглашение</h2>
            <article>
                <h3>1. Основные положения.</h3>
                <p>1.1. В соответствии с настоящим ПС (пользовательское соглашение) Исполнитель обязуется оказать консультационно - информационные услуги в области киберспорта по дисциплине в форме семинара, включающем практические и теоретические занятия, а Заказчик обязуется оплатить услуги, оказываемые Исполнителем, в порядке, предусмотренном настоящим Договором.</p>
                <p>1.2. Настоящим Заказчик подтверждает, что он уведомлен о том, что возрастное ограничение киберспортивной дисциплины, указанной в п. 1.1. настоящего договора составляет 13 лет (<a href='https://store.steampowered.com/subscriber_agreement/'>https://store.steampowered.com/subscriber_agreement/</a>), гарантирует соблюдение этого ограничения и самостоятельно несет всю ответственность за их несоблюдение. В случае, если настоящий договор заключен в интересах несовершеннолетнего Участника, указанного в преамбуле настоящего Договора, Заказчик, т.е. законный представитель (родители, опекуны), гарантирует соблюдение несовершеннолетним, в интересах которого заключен настоящий договор, возрастных ограничений киберспортивной дисциплины, указанной в п.1.1. настоящего Договора и принимают на себя всю полноту ответственности за нарушение таких ограничений.</p>
                <p>1.3. В случае если настоящий договор заключен в интересах несовершеннолетнего, настоящим законные представители (родители, опекуны) дают согласие на оказание услуг несовершеннолетнему Исполнителем.</p>
                <p>1.4. Заказчик самостоятельно принимает решение о получении услуг по настоящему договору и при необходимости консультируется со специалистами по вопросам своего здоровья (физического, психического), при этом Заказчик несет ответственность за любые отклонения состояния здоровья Участника (как физического, так и психологического). До начала оказания услуг Заказчик проинформирован, что Исполнитель отказывает в оказании услуг при наличии у Участника любого из следующих состояний здоровья, любого из следующих заболеваний:</p>
                <ul>
                    <li>сердечно-сосудистые заболевания (аневризма, выраженная гипертензия, постинфарктные и постинсультные состояния и т.д.);</li>
                    <li>проблемы с сосудами головного мозга; - психиатрические заболевания (шизофрения и т.д);</li>
                    <li>эпилепсия;</li>
                    <li>состояние реабилитации после перенесенных хирургических вмешательств (переломы и операции с момента которых прошло менее 6 календарных месяцев);</li>
                    <li>постановка на учет в психоневрологический диспансер.</li>
                </ul>
                <p>1.5. Заказчик настоящим подтверждает, что до начала оказания услуг ему известно, и он осознает содержание, сюжет, тип программного продукта, используемого при проведении семинара по киберспортивной дисциплине, указанной в п.1.1 Договора. Заказчик настоящим подтверждает, что он ознакомлен с правилами использования программного продукта, размещенными на сайте <a href='http://store.steampowered.com/'>http://store.steampowered.com/</a>, и гарантирует соблюдение Участником таких правил.</p>
                <p>1.6. Информационные услуги ограничены предоставлением Участнику необходимой информации и формированием навыков для её самостоятельного использования.</p>
                <p>1.7. На сайте <a href='www.ggplay.ru'>www.ggplay.ru</a> Заказчик выбирает удобное время тренировки и тренера, который свободен в это время. После оплаты за Заказчиком бронируются выбранные дата и время. Не ранее чем за 15 минут до тренировки с Заказчиком связывается тренер в Discord. Перед первой тренировкой заполняется анкета с целью составления дальнейшего игрового портрета, определения цели тренировок и поставления планки для результата. Занятие - это комплекс теории и практики в игре вместе с тренером. Что включает в себя как совместные игры, игра с комментариями и подсказками тренера, так и разборы реплеев/моментов не только своих матчей, но и профессиональных игроков, а также упражнения и домашние задания.</p>
                <p>1.8. Дата и время проведения каждого отдельного занятия выбирается на сайте и согласовывается с доступным временем для занятий в расписании у выбранного тренера.</p>
            </article>
            <article>
                <h3>2. Права Сторон.</h3>
                <p>2.1. Исполнитель вправе:</p>
                <p>2.1.1. оказывать информационные услуги своими силами и/или с привлечением третьих лиц;</p>
                <p>2.1.2. приостановить выполнение своих обязанностей или отказаться от исполнения Договора (от проведения тренировок) без возврата средств и тренировок, оставшихся на счету, если:</p>
                <ul>
                    <li>Заказчик использует читы (внешние программы, нестандартное аппаратное обеспечение или нестандартная манера игры с целью получения нечестного преимущества перед другими игроками в многопользовательской сетевой игре) или заказчиком был получен бан за использование читов на одном из его аккаунтов;</li>
                    <li>Заказчик оскорбляет тренера и пр.</li>
                </ul>
                <p>В случае отсутствия у тренера возможности провести тренировку в назначенное время, платформа вправе предложить перенос тренировки на другое время и/или замену тренера.</p>
                <p>2.1.3 осуществлять аудиозапись (или) видеозапись, фотографирование в период оказания услуг для дальнейшего распространения данных материалов с целью создания обучающего контента.</p>
                <p>2.1.4. не возвращать средства за оплаченную тренировку, если Заказчик предупредил об отмене или переносе тренировки менее чем за сутки до назначенного времени.</p>
                <p>2.2. Заказчик вправе:</p>
                <p>2.2.1. пользоваться в порядке, установленном внутренними локальными актами Исполнителя, информационными материалами Исполнителя, необходимыми для освоения информации;</p>
                <p>2.2.2. в личных целях конспектировать на Семинаре без права последующей переработки, воспроизведения, исполнения или создания на базе Семинара новых объектов интеллектуальной собственности.</p>
            </article>
            <article>
                <h3>3. Обязанности Сторон</h3>
                <p>3.1. Заказчик обязуется:</p>
                <p>3.1.1. не допускать разжигание межнациональных конфликтов, оскорбление других участников специалистов Исполнителя, использование нецензурных высказываний.</p>
                <p>3.1.2. не использовать препараты, содержащие наркотические вещества, алкоголь во время получения услуг.</p>
                <p>3.1.3 не осуществлять аудиозапись (или) видеозапись, фотографирование в период оказания услуг.</p>
                <p>3.1.4. производить оплату в соответствии с условиями настоящего договора.</p>
                <p>3.1.5. гарантировать выполнение общих правил семинара, принятых Исполнителем и доведенных до сведения Заказчика.</p>
                <p>3.1.6. предоставлять Исполнителю необходимые и достоверные сведения и документы в сроки и в объеме, запрашиваемые Исполнителем.</p>
                <p>3.1.7. не передавать третьим лицам, не указанным в настоящем Договоре, прав или на получение услуг или сопутствующих материалов по настоящему договору без согласия Исполнителя.</p>
                <p>3.1.8. не распространять без согласия Исполнителя материалы, полученные им в связи с участием в семинаре.</p>
                <p>3.1.9. не воспроизводить, не повторять, не копировать, не продавать, а также не использовать в каких бы то ни было иных целях информацию и материалы, ставшие ему доступными в связи с оказанием услуг, за исключением их личного использования. Исполнитель имеет право прекратить оказание услуг, в случае нарушения Заказчиком условий, указанных в п. 3.1. настоящего договора Услуги считаются оказанными Исполнителем в полном объеме и приняты Участником без замечаний при отсутствии поданных от Участника письменных претензий в порядке, установленном в п.7.1. Общих условий.</p>
            </article>
            <article>
                <h3>4. Стоимость услуг и порядок оплаты.</h3>
                <p>4.1. Стоимость информационных услуг зависит от выбранного пакета тренировок и может варьироваться.</p>
                <p>4.2. Оплата производится в безналичной форме до начала оказания услуг Исполнителем путем перечисления денежных средств на счет Исполнителя.</p>
                <p>4.3. Исполнитель не компенсирует Заказчику расходы, связанные с оплатой, выполненной в безналичной форме, в том числе при использовании для оплаты услуги электронных платежных систем, банковские и иные комиссии, уплаченные Участником в этой связи.</p>
                <p>4.4. При прекращении оказания услуг в связи с нарушением Заказчиком обязательств, указанных в п.3.1. настоящего договора, возврат денежных средств не осуществляется.</p>
                <p>4.5. Мы гарантируем безопасность платежей при оплате банковской картой. Процессинговый центр соответствует международным требованиями PCI DSS для обеспечения безопасной обработки реквизитов банковской карты плательщика.</p>
            </article>
            <article>
                <h3>5. Обработка персональных данных.</h3>
                <p>5.1. Заключая настоящий Договор Заказчик (Участник) выражает свое согласие с тем, что сбор, обработка, хранение внесенных им при заключении Договора персональных данных осуществляется на основании Федерального закона №152-ФЗ от 27 июля 2006 года «О персональных данных», решение о предоставлении его персональных данных и предоставление согласия на их обработку, сбор, хранение принято Заказчиком свободно, в соответствии со своей волей и в своем интересе. Заказчик дает согласие Исполнителю на любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, предоставление, доступ, обезличивание, блокирование, удаление, уничтожение персональных данных, связанных с оказанием Заказчику услуг по настоящему договору.</p>
                <p>5.2. Исполнитель при обработке персональных данных Заказчика обязуется принять все предусмотренные меры для их защиты от несанкционированного доступа</p>
                <p>5.3. Заказчик настоящим подтверждает свое согласие на любое использование (в том числе, публикацию, обработку и прочее) Исполнителем фото-, видео- изображений Заказчика/Участника, сделанных во время оказания услуг Исполнителем в качестве иллюстрации услуг Исполнителя (семинара), для размещения его в телекоммуникационной сети Интернет. В случае, если настоящий договор заключен в интересах несовершеннолетнего Участника, указанного в преамбуле настоящего Договора, Заказчик, т.е. законный представитель (родители, опекуны), настоящим подтверждает свое согласие на любое использование (в том числе, публикацию, обработку и прочее) Исполнителем, фото- видео- изображений несовершеннолетнего Участника, сделанных во время оказания услуг Исполнителем в качестве иллюстрации услуг Исполнителя (семинара), для размещения его в телекоммуникационной сети Интернет.</p>
                <p>5.4. Кроме того, настоящим Заказчик соглашается получать от Исполнителя информацию, в том числе являющуюся рекламой, по указанным Участником номеру телефона и адресу электронной̆ почты, через бота в Steam, Discord или мессенджерах (telegram, WhatsApp и пр.)</p>
                <p>5.5. Участник вправе отозвать согласие на обработку персональных данных. Данный отзыв Участник предоставляет Исполнителю лично в письменном виде.</p>
            </article>
            <article>
                <h3>6. Защита интеллектуальной собственности.</h3>
                <p>6.1. Оказание услуг Исполнителем в форме Семинара по настоящему договору (в равной степени – его содержание и форма) является результатом интеллектуальной деятельности (произведением) Исполнителя, которому предоставлена правовая охрана законодательством Российской Федерации.</p>
                <p>6.2. Настоящий Договор не является основанием для предоставления исключительных прав или прав использования произведения в каком-либо объёме Заказчику (Участнику).</p>
                <p>6.3. Исполнитель, как правообладатель исключительных прав, запрещает:</p>
                <p>6.3.1. запись, копирование, распространение материалов семинара, путём звуко- и видеозаписи, записи на электронном носителе, в том числе в память ЭВМ;</p>
                <p>6.3.2. трансляцию семинара по радио, телевидению, по кабелю, в сети Интернет (в том числе путём ретрансляции);</p>
                <p>6.3.3. любую переработку полученной услуги, т.е. создание производного произведения (обработку, экранизацию, выпуск книги или создание литературных произведений, конспектов и тому подобное).</p>
            </article>
            <article>
                <h3>7. Ответственность сторон.</h3>
                <p>7.1. Стороны несут ответственность в соответствии с действующем законодательством Российской Федерации.</p>
                <p>7.2. Стороны не несут ответственности за неисполнение или ненадлежащее исполнение обязательств по настоящему договору, вызванное действиями обстоятельств непреодолимой силы (ураган, землетрясение, наводнение, забастовки и прочее).</p>
                <p>7.3. <a href='https://ggplay.ru'>ggplay.ru</a> не несет ответственности за: - какие-либо прямые, косвенные, случайные, последующие, специальные, типовые, штрафные или иные убытки или ущерб (включая, помимо прочего, убытки в результате упущенной выгоды, упущенных сделок, использования данных или другие нематериальные убытки), связанные с любым контрактом, деликтом (включая, в частности, небрежность и объективную ответственность) или иной правовой теорией, независимо от причин, вызванные или относящийся каким-либо образом к Веб-сайту, его содержанию или любой информации на Веб-сайте, или любым ошибкам или неточностям, содержащимся в нем; - то, что аппаратное обеспечение, программное обеспечение или подключение к Интернету не функционируют должным образом; - любое приостановление или отказ от принятия платежей, если ggplay.ru обоснованно полагает, что они были сделаны обманным путем или без соответствующих полномочий; - непредвиденные обстоятельства, препятствующие надлежащей работе, несмотря на любые разумные меры предосторожности, предпринятые www.ggplay.ru (отключения электроэнергии, пожар, наводнение, похищение имущества, поломки оборудования, хакерские атаки, внутренние механические или системные сбои, а также простои Вебсайта).</p>
            </article>
            <article>
                <h3>8. Основания и порядок расторжения договора.</h3>
                <p>8.1. Договор может быть расторгнут по соглашению Сторон, а также в одностороннем порядке по письменному требованию одной из Сторон по основаниям, предусмотренным законодательством либо за нарушение прав и обязанностей, предусмотренных данным Договором.</p>
            </article>
            <article>
                <h3>9. Конфиденциальность.</h3>
                <p>9.1. Условия настоящего договора и дополнительных соглашений (протоколов и т.п.) к нему конфиденциальны и не подлежат разглашению.</p>
                <p>9.2. Стороны принимают все необходимые меры для того, чтобы их сотрудники, агенты, правопреемники без предварительного согласия другой стороны не информировали третьих лиц о деталях данного договора и дополнительных соглашений к нему.</p>
            </article>
            <article>
                <h3>10. Разрешение споров.</h3>
                <p>10.1. Все споры и разногласия, которые могут возникнуть между сторонами по вопросам, не нашедшим своего разрешения в тексте данного договора, будут разрешаться путем переговоров.</p>
                <p>10.2. Претензионный порядок досудебного урегулирования споров обязателен.</p>
                <p>10.3. Претензия предъявляется в письменной форме и подписывается руководителем Стороны или его уполномоченным заместителем.</p>
                <p>10.4. Претензия рассматривается в течение 10 дней со дня ее получения. Ответ на претензию подписывается руководителем Стороны или его уполномоченным заместителем.</p>
                <p>10.5. При невозможности решения споров и разногласий путем переговоров, они подлежат рассмотрению в соответствии с действующем законодательством России.</p>
            </article>
            <article>
                <h3>11. Прочие условия.</h3>
                <p>11.1. Стороны не имеют никаких сопутствующих устных договоренностей. Содержание текста Договора полностью соответствует действительному волеизъявлению Сторон.</p>
                <p>11.2. Вся переписка по предмету Договора, предшествующая его заключению, теряет юридическую силу со дня заключения Договора.</p>
                <p>11.3. Стороны признают, что если какое-либо из положений Договора становится недействительным в течение срока его действия вследствие изменения законодательства, остальные положения Договора обязательны для Сторон в течение срока действия Договора.</p>
                <p>11.4. Пользуясь данным сайтом и услугами сайта, Вы автоматически принимаете на себя ответственность и обязанности, которые указаны в данном пользовательском соглашении (п. 3, п. 7).</p>
            </article>
        </div>
    );
}

export default TermsOfService;
